app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `single_access_token`, `perishable_token`, `current_login_ip`, `oauth2_token`, `password_salt`, `current_login_at`, `failed_login_count`, `facebook_uid`, `persistence_token`, `login_count`, `email`, `last_login_ip`, `created_at`) VALUES(NULL, '2010-10-12 04:10:24', '2010-10-12 04:10:24', '', 'uw9Ufjucr-uvJ3JKpJSo', 'FxXj6CQADADRgRAGjXOa', '127.0.0.1', '102633759803127|3ce7afd7c99f70b3f372a013-502671879|oN0oSsWZUij_FXkZ6m-F1Nh6x5U', '', '2010-10-12 04:10:24', 0, '502671879', '7230e78e27052b61c50e033cd57cc3f53955c96796b9f90de05d5534a49b0f34555f7caa008c930e1eb7d273ee5a5b59f6fe2f71794400da403acaf1bcab1d78', 1, 'tjhanley.com@gmail.com', NULL, '2010-10-12 04:10:24')
---
  def create
    @user = User.new(params[:user])
    @user.save do |result|